In [1]:
import numpy as np 
import pandas as pd

# Data Frame

## Creating DataFrame

In [2]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 101200, 85000]
}

In [3]:
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin  101200
3  Linda   42    London   85000

## Selecting and Indexing of columns

In [4]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin  101200
3  Linda   42    London   85000

Selecting one column

In [5]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

Selecting multiple column

In [6]:
df[["Name", "Salary", "City"]]

    Name  Salary      City
0   John   65000  New York
1   Anna   70000     Paris
2  Peter  101200    Berlin
3  Linda   85000    London

## Creating new column

In [7]:
df["Designation"] = ["CA", "Software Engineer", "AI Architecture", "CEO"]

In [8]:
df

    Name  Age      City  Salary        Designation
0   John   28  New York   65000                 CA
1   Anna   34     Paris   70000  Software Engineer
2  Peter   29    Berlin  101200    AI Architecture
3  Linda   42    London   85000                CEO

## Remove column

Remove a single column

In [9]:
# Temporary removing

df.drop("Designation", axis = 1)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin  101200
3  Linda   42    London   85000

In [10]:
df

    Name  Age      City  Salary        Designation
0   John   28  New York   65000                 CA
1   Anna   34     Paris   70000  Software Engineer
2  Peter   29    Berlin  101200    AI Architecture
3  Linda   42    London   85000                CEO

In [11]:
# Permanent removing

df.drop("Designation", axis = 1, inplace = True)

In [12]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin  101200
3  Linda   42    London   85000

Removes multiple column

In [13]:
df.drop(["City", "Age"], axis = 1)

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter  101200
3  Linda   85000

In [14]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin  101200
3  Linda   42    London   85000

## Selecting rows

Selecting a single Row

In [15]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin  101200
3  Linda   42    London   85000

In [16]:
df.loc[1]

Name       Anna
Age          34
City      Paris
Salary    70000
Name: 1, dtype: object

Selecting multiples Row

In [17]:
df.loc[[1, 2]]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin  101200

Select using Index Location(iloc)

In [18]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin  101200
3  Linda   42    London   85000

In [19]:
df.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

In [20]:
df.iloc[[2, 3]]

    Name  Age    City  Salary
2  Peter   29  Berlin  101200
3  Linda   42  London   85000

## Selecting Subset Rows and Columns

In [21]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin  101200
3  Linda   42    London   85000

In [22]:
df.loc[[2,3]][["Name", "Age"]]

    Name  Age
2  Peter   29
3  Linda   42

## Conditional Selection

In [23]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin  101200
3  Linda   42    London   85000

In [25]:
df[df["Salary"] > 80000]

    Name  Age    City  Salary
2  Peter   29  Berlin  101200
3  Linda   42  London   85000

In [27]:
# AND
df[(df["Salary"] > 80000) & (df["Age"] > 28)]

    Name  Age    City  Salary
2  Peter   29  Berlin  101200
3  Linda   42  London   85000

In [28]:
# OR
df[(df["Salary"] > 80000) | (df["Age"] > 40)]

    Name  Age    City  Salary
2  Peter   29  Berlin  101200
3  Linda   42  London   85000